Revit 2026 API

# TemporaryGraphicsManager Properties

---

The TemporaryGraphicsManager type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

TemporaryGraphicsManager Class

Autodesk.Revit.DB Namespace